snlkuharlocal/src/Documents/КоллективныеРаботы/КоллективныеРаботы.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document>
  <name>КоллективныеРаботы</name>
  <basedOn>Document.ПриходнаяНакладная</basedOn>
  <basedOn>Document.ЛистЗагрузки</basedOn>
  <basedOn>Document.РасходнаяНакладная</basedOn>
  <basedOn>Document.Комплектация</basedOn>
  <attributes>
    <name>ДатаПрибытия</name>
    <type>
      <types>Date</types>
    </type>
  </attributes>
  <attributes>
    <name>ДатаНачалаРабот</name>
    <type>
      <types>Date</types>
    </type>
  </attributes>
  <attributes>
    <name>КоличествоСотрудников</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>4</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ПриостановкаРабот</name>
    <type>
      <types>Date</types>
    </type>
  </attributes>
  <attributes>
    <name>ВозобновлениеРабот</name>
    <type>
      <types>Date</types>
    </type>
  </attributes>
  <attributes>
    <name>ДатаОкончанияРабот</name>
    <type>
      <types>Date</types>
    </type>
  </attributes>
  <attributes>
    <name>ДатаУбытия</name>
    <type>
      <types>Date</types>
    </type>
  </attributes>
  <attributes>
    <name>КоличествоСтрокДокОснования</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>КоличествоКоробов</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>КоличествоЧеловекоЧасов</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ВидРаботы</name>
    <type>
      <types>CatalogRef.ВидыВыполняемыхРабот</types>
    </type>
  </attributes>
  <attributes>
    <name>Состояние</name>
    <type>
      <types>EnumRef.СостоянияНакладной</types>
    </type>
  </attributes>
  <attributes>
    <name>ДокОснование</name>
    <type>
      <types>DocumentRef.Комплектация</types>
      <types>DocumentRef.ЗаданиеНабора</types>
      <types>DocumentRef.ЛистМаркировкиОстатков</types>
      <types>DocumentRef.ПриходнаяНакладная</types>
      <types>DocumentRef.ЛистСборкиКомплектовЧЗ</types>
      <types>DocumentRef.ЗаданиеНаСборкуКомплектовЧЗ</types>
      <types>DocumentRef.РасходнаяНакладная</types>
      <types>DocumentRef.ЗаданиеНаМаркировку</types>
      <types>DocumentRef.ЛистЗагрузки</types>
      <types>DocumentRef.Перемещение</types>
    </type>
  </attributes>
  <attributes>
    <name>ПаузаВРаботе</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>20</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ВремяПростояДоВыгрузки</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>20</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ВремяРаботы</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>20</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ВремяРаботыЧистое</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>20</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ВремяПребыванияОбщее</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>20</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Автор</name>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </attributes>
  <attributes>
    <name>Комментарий</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>50</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>КоличествоШтук</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>КоличествоПаллет</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>13</precision>
        <scale>4</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>РабочееМесто</name>
    <type>
      <types>CatalogRef.РабочиеМеста</types>
    </type>
  </attributes>
  <attributes>
    <name>ПоследняяРабота</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>БригадаСформирована</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <tabularSections>
    <name>Данные</name>
    <attributes>
      <name>ВидРаботы</name>
      <type>
        <types>CatalogRef.ВидыВыполняемыхРабот</types>
      </type>
    </attributes>
    <attributes>
      <name>Сотрудник</name>
      <type>
        <types>CatalogRef.ФизическиеЛица</types>
      </type>
    </attributes>
    <attributes>
      <name>НачалоВыполнения</name>
      <type>
        <types>Date</types>
      </type>
    </attributes>
    <attributes>
      <name>ОкончаниеВыполнения</name>
      <type>
        <types>Date</types>
      </type>
    </attributes>
    <attributes>
      <name>НачалоПаузы</name>
      <type>
        <types>Date</types>
      </type>
    </attributes>
    <attributes>
      <name>ПродолжительностьПаузы</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>20</precision>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ЧеловекоЧасов</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>10</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ВедущийСотрудник</name>
      <type>
        <types>CatalogRef.ФизическиеЛица</types>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>Накладные</name>
    <attributes>
      <name>Накладная</name>
      <type>
        <types>DocumentRef.Комплектация</types>
        <types>DocumentRef.ЗаданиеНабора</types>
        <types>DocumentRef.ЛистМаркировкиОстатков</types>
        <types>DocumentRef.ПриходнаяНакладная</types>
        <types>DocumentRef.ЛистСборкиКомплектовЧЗ</types>
        <types>DocumentRef.ЗаданиеНаСборкуКомплектовЧЗ</types>
        <types>DocumentRef.РасходнаяНакладная</types>
        <types>DocumentRef.ЗаданиеНаМаркировку</types>
        <types>DocumentRef.ЛистЗагрузки</types>
        <types>DocumentRef.Перемещение</types>
      </type>
    </attributes>
    <attributes>
      <name>КоличествоКоробок</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>10</precision>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>КоличествоСтрок</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>10</precision>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>КоличествоШтук</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>10</precision>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>КоличествоПаллет</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>13</precision>
          <scale>4</scale>
        </numberQualifiers>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Document>

snlkuharlocal/src/InformationRegisters/СтатусРаботыСотрудника/СтатусРаботыСотрудника.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>СтатусРаботыСотрудника</name>
  <comment>Контроль заданий сотрудника</comment>
  <informationRegisterPeriodicity>Second</informationRegisterPeriodicity>
  <resources>
    <name>ДатаНачала</name>
    <type>
      <types>Date</types>
    </type>
  </resources>
  <resources>
    <name>ДатаОкончания</name>
    <type>
      <types>Date</types>
    </type>
  </resources>
  <attributes>
    <name>Комментарий</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>150</length>
      </stringQualifiers>
    </type>
  </attributes>
  <dimensions>
    <name>Сотрудник</name>
    <type>
      <types>CatalogRef.ФизическиеЛица</types>
    </type>
  </dimensions>
  <dimensions>
    <name>ВидРаботы</name>
    <type>
      <types>CatalogRef.ВидыДопОбработки</types>
    </type>
  </dimensions>
  <dimensions>
    <name>ДокументОснования</name>
    <type>
      <types>DocumentRef</types>
    </type>
  </dimensions>
</mdclass:InformationRegister>

snlkuharlocal/src/Catalogs/ВидыВыполняемыхРабот/ВидыВыполняемыхРабот.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog>
  <name>ВидыВыполняемыхРабот</name>
  <hierarchical>true</hierarchical>
  <predefined>
    <items>
      <name>ВыгрузкаИзАвтомобиля</name>
      <description>Выгрузка из автомобиля</description>
    </items>
    <items>
      <name>ДопОбработка</name>
      <description>Доп обработка</description>
    </items>
    <items>
      <name>ЗагрузкаВАвтомобиль</name>
      <description>Загрузка в автомобиль</description>
    </items>
    <items>
      <name>Комплектация</name>
      <description>Комплектация</description>
    </items>
    <items>
      <name>Маркировка</name>
      <description>Маркировка</description>
    </items>
    <items>
      <name>НаборМаршрутногоЛиста</name>
      <description>Набор маршрутного листа</description>
    </items>
    <items>
      <name>Термоусадка</name>
      <description>Термоусадка</description>
    </items>
  </predefined>
  <attributes>
    <name>ШтрихКод</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>13</length>
      </stringQualifiers>
    </type>
  </attributes>
</mdclass:Catalog>

snlkuharlocal/src/Documents/КоллективныеРаботы/ObjectModule.bsl
//Кухарь 13.08.18 начало
//Термоусадка теперь будет в коллективных работах
Процедура ЗаписатьПланНабора (Накладная,Сотрудник)
	если ложь тогда накладная=Документы.РасходнаяНакладная.ПустаяСсылка();КонецЕсли;
	Запрос=новый запрос;
	запрос.Текст="ВЫБРАТЬ первые 1
	|	ПланНабора.Ссылка
	|ИЗ
	|	Документ.ПланНабора КАК ПланНабора
	|ГДЕ
	|	ПланНабора.Проведен
	|	И ПланНабора.Дата >= &Дата
	|	И ПланНабора.Накладная = &Накладная";
	запрос.УстановитьПараметр("Дата",Константы.ДатаЗапретаРедактирования.Получить());
	запрос.УстановитьПараметр("Накладная",Накладная);
	результат=запрос.Выполнить().Выбрать();
	пока результат.Следующий() цикл
		ПланНабораОбъект=результат.ссылка.получитьобъект();
		если ложь тогда ПланНабораОбъект=Документы.ПланНабора.ПустаяСсылка().ПолучитьОбъект();КонецЕсли;
		
		если Состояние=Перечисления.СостоянияНакладной.Отгружена  или  Состояние=Перечисления.СостоянияНакладной.Принята тогда
			Для каждого СтрТЧ из ПланНабораОбъект.тБрэндов цикл
				если СтрТЧ.Состояние<>Перечисления.СостоянияНакладной.ГотоваКОтгрузке тогда
					СтрТЧ.ТермоусадкаЗакончена=Истина;
					СтрТЧ.ОкончаниеТермоусадки=ДатаОкончанияРабот;
					СтрТЧ.Состояние=Перечисления.СостоянияНакладной.ГотоваКОтгрузке;
					если не ЗначениеЗаполнено(СтрТЧ.Термоусадчик) тогда
						СтрТЧ.Термоусадчик=Сотрудник;
					КонецЕсли;
				иначе 
					Прервать;
				КонецЕсли;
			КонецЦикла;
			ПланНабораОбъект.Записать(РежимЗаписиДокумента.Проведение);
		иначе
			Для каждого  СтрТЧ из ПланНабораОбъект.тБрэндов  цикл
				если  СтрТЧ.Состояние<>Перечисления.СостоянияНакладной.Термоусадка и СтрТЧ.Состояние<>Перечисления.СостоянияНакладной.ГотоваКОтгрузке тогда
					СтрТЧ.НачалоТермоусадки=ДатаНачалаРабот;
					СтрТЧ.Термоусадчик=Сотрудник;
					СтрТЧ.Состояние=Перечисления.СостоянияНакладной.Термоусадка;
				иначе 
					Прервать;
				КонецЕсли;
			КонецЦикла;	
			ПланНабораОбъект.Записать(РежимЗаписиДокумента.Проведение);
		КонецЕсли;		
	КонецЦикла;
КонецПроцедуры
//Кухарь 13.08.18 конец

// Шворобей ВЮ 22.07.2025 https://yougile.collant.ru/team/ab6bad3a05c0/#HELP-5976
#Область СтандартныеОбработчики

Процедура ОбработкаЗаполнения(Основание)
	
	Если ТипЗнч(Основание)=Тип("Структура") Тогда Возврат КонецЕсли;	
	
	ДокОснование = Основание;
	Дата = ТекущаяДатаСеанса();
	Состояние = Перечисления.СостоянияНакладной.ВРаботе;
	
	//Кухарь 25.09.19 начало
	Если Основание = Неопределено тогда
		Основание = Документы.РасходнаяНакладная.ПустаяСсылка();
	КонецЕсли;
	//Кухарь 25.09.19 конец
	
	Если Накладные.Найти(Основание) = Неопределено Тогда
		
		СтрТЧ = Накладные.Добавить();
		СтрТЧ.Накладная = Основание;
		
		МетаданныеДокумента = СтрТЧ.Накладная.Метаданные();
		
		Если МетаданныеДокумента.Имя = "ПриходнаяНакладная" тогда				
			СтрТЧ.КоличествоКоробок=Основание.КоличествоКоробок;
			СтрТЧ.КоличествоШтук=Основание.КоличествоДокумента;
			СтрТЧ.КоличествоСтрок=основание.Товары.Количество();
			
		ИначеЕсли МетаданныеДокумента.Имя = "ЛистЗагрузки" тогда
			ТЗСтрок=Основание.Заявка.Выгрузить();
			ТЗСтрок.Свернуть("ПунктДоставки");
			КоличествоСтрокДокОснования=ТЗСтрок.Количество();
			
			
			СтрТЧ.КоличествоКоробок=Основание.Заявка.Итог("КоличествоКоробок");
			СтрТЧ.КоличествоШтук=0;
			СтрТЧ.КоличествоСтрок=КоличествоСтрокДокОснования;
		ИначеЕсли МетаданныеДокумента.Имя = "РасходнаяНакладная" тогда
			СтрТЧ.КоличествоКоробок=Основание.КоличествоКоробок;
			СтрТЧ.КоличествоШтук=Основание.КоличествоДокумента;
			СтрТЧ.КоличествоСтрок=основание.Товары.Количество();
			СтрТЧ.КоличествоПаллет=Основание.количествопаллет;
			
		КонецЕсли;
		
		Если ЕстьТабЧастьДокумента("Товары", МетаданныеДокумента) Тогда
			тзТовары = СтрТЧ.Накладная.Товары.Выгрузить();
		ИначеЕсли ЕстьТабЧастьДокумента("ШтрихкодыУпаковок", МетаданныеДокумента) Тогда
			тзШтрихкодыУпаковок = СтрТЧ.Накладная.ШтрихкодыУпаковок.Выгрузить();
			тзТовары = Документы.КоллективныеРаботы.ПреобразоватьШтрихкодыУпаковокВТовары(тзШтрихкодыУпаковок);
		КонецЕсли;
	
		СтрТЧ.КоличествоШтук = Документы.КоллективныеРаботы.НайтиКоличествоКомплектующих(тзТовары); 
		
	КонецЕсли;
	
	КоличествоШтук = Накладные.Итог("КоличествоШтук");
	
КонецПроцедуры

Процедура ПередЗаписью(Отказ, РежимЗаписи, РежимПроведения)
	
	#Область ПроверкаОбязательныхРеквизитов
	
	Если ДополнительныеСвойства.Свойство("НеЗаполнятьВидРаботы") Тогда
		ОбязательныеРеквизитыШапки = Новый Структура("Состояние, ДатаНачалаРабот");
		ОбязательныеРеквизитыТЧ_Данные = Новый Структура("Сотрудник, НачалоВыполнения");
	Иначе
		ОбязательныеРеквизитыШапки = Новый Структура("Состояние, ВидРаботы, ДатаНачалаРабот");
		ОбязательныеРеквизитыТЧ_Данные = Новый Структура("ВидРаботы, Сотрудник, НачалоВыполнения");
	КонецЕсли;
	
	ПроверитьЗаполнениеШапкиДокумента(ЭтотОбъект, ОбязательныеРеквизитыШапки, Отказ, "Не заполнены реквизиты Шапки документа!!!");
	//Валетов + 28,08,2025 https://yougile.collant.ru/team/ab6bad3a05c0/#HELP-6777
	//Пока оставим проверку только на количество...
	
	//ОбязательныеРеквизитыТЧ_Накладные = Новый Структура("Накладная, КоличествоШтук");
	ОбязательныеРеквизитыТЧ_Накладные = Новый Структура("КоличествоШтук");   
	//Валетов-
	ПроверитьЗаполнениеТабличнойЧасти(ЭтотОбъект, "Накладные", ОбязательныеРеквизитыТЧ_Накладные, Отказ, "Не заполнены реквизиты ТЧ <Накладные>!");
	
	ПроверитьЗаполнениеТабличнойЧасти(ЭтотОбъект, "Данные", ОбязательныеРеквизитыТЧ_Данные, Отказ, "Не заполнены реквизиты ТЧ <Данные>!");
	
	// Кельманов А.В. - SNL-189 - 2026.04.29 {
	// Феданченков М.С.-HELP-9906 - 25.05.2026 начало  
	// Феданченков М.С.-HELP-9928 - 27.05.2026 начало
	//Если ДокОснование.Метаданные().Имя <> "ПриходнаяНакладная" И ЗначениеЗаполнено(ДатаОкончанияРабот) И Состояние <> Перечисления.СостоянияНакладной.Отгружена Тогда
	Если ЗначениеЗаполнено(ДокОснование) И ДокОснование.Метаданные().Имя <> "ПриходнаяНакладная" И ЗначениеЗаполнено(ДатаОкончанияРабот) И Состояние <> Перечисления.СостоянияНакладной.Отгружена Тогда
	// Феданченков М.С.-HELP-9928 - 27.05.2026 конец
	// Феданченков М.С. 25.05.2026 конец	
		Состояние = Перечисления.СостоянияНакладной.Отгружена;
	КонецЕсли;
	// Кельманов А.В. - SNL-189 - 2026.04.29 }
	
	Если Состояние = Перечисления.СостоянияНакладной.Отгружена Тогда
		//Валетов + 28,08,2025 https://yougile.collant.ru/team/ab6bad3a05c0/#HELP-6807
		//Если при сканировании кода окончания работ не заполнилась дата, поставим её текущей.
		Если Не ЗначениеЗаполнено(ДатаОкончанияРабот) Тогда
			ДатаОкончанияРабот = ТекущаяДата();
		КонецЕсли;
		//Валетов-
		
		// Кельманов А.В. - SNL-189 - 2026.04.24 {
		Для Каждого СтрДанных Из Данные Цикл
			
			Если Не ЗначениеЗаполнено(СтрДанных.ОкончаниеВыполнения) Тогда
				
				СтрДанных.ОкончаниеВыполнения = ДатаОкончанияРабот;
					
			КонецЕсли;
			
		КонецЦикла;
		// Кельманов А.В. - SNL-189 - 2026.04.24 }
		
		ОбязательныеРеквизитыШапки = Новый Структура("ДатаОкончанияРабот");
		ПроверитьЗаполнениеШапкиДокумента(ЭтотОбъект, ОбязательныеРеквизитыШапки, Отказ, "Не заполнены реквизиты Шапки документа!!!");
		
		ОбязательныеРеквизитыТЧ_Данные = Новый Структура("ОкончаниеВыполнения");
		ПроверитьЗаполнениеТабличнойЧасти(ЭтотОбъект, "Данные", ОбязательныеРеквизитыТЧ_Данные, Отказ, "Не заполнены реквизиты ТЧ <Данные>!");
		
	КонецЕсли;
	
	#КонецОбласти
	
	Если ВидРаботы<>Справочники.ВидыВыполняемыхРабот.ВыгрузкаИзАвтомобиля и Состояние<>Перечисления.СостоянияНакладной.Отгружена и Состояние<>Перечисления.СостоянияНакладной.Принята и Данные.Количество()>0  тогда
		МассСтрок=Данные.НайтиСтроки(новый Структура("ОкончаниеВыполнения",ПустаяДата()));
		если МассСтрок.Количество()=0 тогда
			
			
			//Кухарь 23.01.19 начало
			//Иногда одни доп обработчики могут начать и закончить раньше чем начнут другие
			если ВидРаботы=Справочники.ВидыВыполняемыхРабот.ДопОбработка  тогда
				запрос=новый запрос;
				запрос.Текст="ВЫБРАТЬ ПЕРВЫЕ 1
				|	ПланНаборатБрэндов.Наборщик
				|ИЗ
				|	Документ.ПланНабора.тБрэндов КАК ПланНаборатБрэндов
				|ГДЕ
				|	ПланНаборатБрэндов.Ссылка.Проведен
				|	И ПланНаборатБрэндов.Ссылка.Дата >= &Дата
				|	И (НЕ ПланНаборатБрэндов.ДопОбработкаЗакончена)
				|	И ПланНаборатБрэндов.Ссылка.Накладная = &Накладная";
				запрос.УстановитьПараметр("Дата",Константы.ДатаЗапретаРедактирования.Получить());
				запрос.УстановитьПараметр("Накладная",ДокОснование);
				КолСтрок=запрос.Выполнить().Выгрузить().Количество();						
				//если Накладные.Получить(0).Накладная.СостояниеНакладной=Перечисления.СостоянияНакладной.ДопОбработка или Накладные.Получить(0).Накладная.СостояниеНакладной=Перечисления.СостоянияНакладной.ОжиданиеДопОбработки тогда
				если КолСтрок>0 тогда
					НельзяЗаканчивать=Истина
				КонецЕсли;
			КонецЕсли;
			если НельзяЗаканчивать<>Истина тогда
				//Кухарь 23.01.19 Конец
				
				ВсёЗакончили=Истина;
				Состояние=Перечисления.СостоянияНакладной.Отгружена;
				ДатаОкончанияРабот=ТекущаяДата();
				//Кухарь 23.01.19 начало
				//Иногда одни доп обработчики могут начать и закончить раньше чем начнут другие
			КонецЕсли;
			//Кухарь 23.01.19 Конец
			
		КонецЕсли;		
	КонецЕсли;
	
	// Кухарь А.Ю. 28.01.2020 начало
	//  чтобы не было неопределено
	для каждого СтрТЧ из Накладные цикл
		если СтрТЧ.Накладная =Неопределено тогда
			СтрТЧ.Накладная=документы.РасходнаяНакладная.ПустаяСсылка();
		КонецЕсли;
	КонецЦикла; 
	// Кухарь А.Ю. 28.01.2020 конец
	
	
	
	
	//Кухарь 30.01.19 начало	
	//если ДокОснование=Неопределено и Накладные.Количество()>0 тогда
	если (ДокОснование=Неопределено или СокрЛП(ДокОснование.номер)="") и Накладные.Количество()>0 тогда
		//Кухарь 30.01.19 конец	
		//Кухарь 25.06.19 начало
		//Чтобы не было ошибок при проверке метаданных
		//ДокОснование=Накладные.Получить(0).Накладная;
		ДокОснование=?(Накладные.Получить(0).Накладная=Неопределено,Документы.РасходнаяНакладная.ПустаяСсылка(),Накладные.Получить(0).Накладная);
		//Кухарь 25.06.19 конец		
	КонецЕсли;
	
	если Накладные.Количество()=0 и ДокОснование<>Неопределено тогда
		СтрТЧ=Накладные.Добавить();
		СтрТЧ.Накладная=ДокОснование;
		Если ДокОснование.метаданные().имя="ПриходнаяНакладная" тогда				
			СтрТЧ.КоличествоКоробок=ДокОснование.КоличествоКоробок;
			СтрТЧ.КоличествоШтук=ДокОснование.КоличествоДокумента;
			СтрТЧ.КоличествоСтрок=ДокОснование.Товары.Количество();
		ИначеЕсли ДокОснование.метаданные().имя="ЛистЗагрузки" тогда
			ТЗСтрок=ДокОснование.Заявка.Выгрузить();
			ТЗСтрок.Свернуть("ПунктДоставки");
			КоличествоСтрокДокОснования=ТЗСтрок.Количество();
			
			
			СтрТЧ.КоличествоКоробок=ДокОснование.Заявка.Итог("КоличествоКоробок");
			СтрТЧ.КоличествоШтук=0;
			СтрТЧ.КоличествоСтрок=КоличествоСтрокДокОснования;
		ИначеЕсли ДокОснование.метаданные().имя="РасходнаяНакладная" тогда
			СтрТЧ.КоличествоКоробок=ДокОснование.КоличествоКоробок;
			СтрТЧ.КоличествоШтук=ДокОснование.КоличествоДокумента;
			СтрТЧ.КоличествоСтрок=ДокОснование.Товары.Количество();
			СтрТЧ.КоличествоПаллет=ДокОснование.количествопаллет;
			
			
		КонецЕсли;
		
	КонецЕсли;
	
	
	
	ПаузаВРаботе=?(ПриостановкаРабот=ПустаяДата(),0,ВозобновлениеРабот-ПриостановкаРабот);
	ВремяПростояДоВыгрузки=?(ДатаНачалаРабот=ПустаяДата(),0,ДатаНачалаРабот-ДатаПрибытия);
	ВремяРаботы=?(ДатаОкончанияРабот=ПустаяДата(),0,ДатаОкончанияРабот-ДатаНачалаРабот);
	ВремяРаботыЧистое=ВремяРаботы-ПаузаВРаботе;	
	ВремяПребыванияОбщее=?(ДатаУбытия=ПустаяДата(),0,ДатаУбытия-ДатаПрибытия);
	
	если ДатаУбытия<ДатаПрибытия и ДатаУбытия<>ПустаяДата() тогда
		Сообщить("Дата убытия не может быть раньше даты прибытия");
		отказ=Истина;
	КонецЕсли;
	если ДатаОкончанияРабот<ДатаНачалаРабот и ДатаОкончанияРабот<>ПустаяДата() тогда
		Сообщить("Дата окончания работ не может быть раньше даты начала работ");
		отказ=Истина;
	КонецЕсли;
	
	//Кухарь 08.08.18 начало
	//Чтобы исключить дурацкие ошибки
	если ВидРаботы=Справочники.ВидыВыполняемыхРабот.ВыгрузкаИзАвтомобиля тогда
		если не ЗначениеЗаполнено(ДатаПрибытия) тогда
			Сообщить("Заполните дату прибытия");
			отказ=Истина;
		ИначеЕсли  ДатаПрибытия>ДатаНачалаРабот и ЗначениеЗаполнено(ДатаНачалаРабот) тогда
			Сообщить("Дата прибытия не может быть позже даты начала работ");
			отказ=Истина;
		КонецЕсли;
	КонецЕсли;
	//Кухарь 08.08.18 конец
	
	если ЭтоНовый() и не ОбменДанными.Загрузка тогда
		дата=ТекущаяДата();
		Состояние=Перечисления.СостоянияНакладной.ВРаботе;
		если автор=Справочники.Пользователи.ПустаяСсылка() тогда
			Автор=ПараметрыСеанса.Пользователь;
		КонецЕсли;
	КонецЕсли;

	СтрокаОшибок = "";
	
	Если Состояние = Перечисления.СостоянияНакладной.Принята Или Состояние = Перечисления.СостоянияНакладной.Отгружена Тогда

		КоличествоСотрудников = Данные.Количество();

		//Кухарь 17.10.19 начало
		Если Не ЗначениеЗаполнено(ДатаОкончанияРабот) Тогда
			ДатаОкончанияРабот = ТекущаяДата();
		КонецЕсли;
		//Кухарь 17.10.19 конец		

		Для Каждого СтрДанных Из Данные Цикл
			
			Если СтрДанных.НачалоВыполнения = ПустаяДата() Тогда
				СтрокаОшибок = СтрокаОшибок + "по сотруднику " + СтрДанных.Сотрудник + " не указана дата начала работы." + Символы.ПС;
			КонецЕсли;
			
			Если СтрДанных.ОкончаниеВыполнения = ПустаяДата() Тогда
				СтрокаОшибок = СтрокаОшибок + "по сотруднику " + СтрДанных.Сотрудник + " не указана дата окончания работы." + Символы.ПС;
			КонецЕсли;
			
			Если СтрДанных.Сотрудник = Справочники.ФизическиеЛица.ПустаяСсылка() Тогда
				СтрокаОшибок = СтрокаОшибок + "В  строке " + СтрДанных.НомерСтроки + " не указан сотрудник." + Символы.ПС;
			КонецЕсли;
			
			ВремРаботы = ?(СтрДанных.ОкончаниеВыполнения = ПустаяДата(), 0, СтрДанных.ОкончаниеВыполнения - СтрДанных.НачалоВыполнения);
			СтрДанных.ЧеловекоЧасов = Окр((ВремРаботы - СтрДанных.ПродолжительностьПаузы) / 3600, 2);					

			//КоличествоЧеловекоЧасов=
			
		КонецЦикла;

		КоличествоЧеловекоЧасов=Данные.Итог("ЧеловекоЧасов");
		
		//Кухарь 21.06.19 начало
		//Чтобы не было конфигураторных ошибко при сравнениях
		если ДокОснование=Неопределено   тогда
			ДокОснование=Документы.РасходнаяНакладная.ПустаяСсылка();
			если Накладные.Количество()=1 и Накладные.Получить(0).Накладная=Неопределено тогда
				Накладные.Получить(0).Накладная=Документы.РасходнаяНакладная.ПустаяСсылка();
			КонецЕсли;
		КонецЕсли;
		//Кухарь 21.06.19 конец
		
		//Кухарь 05.02.19 начало
		//Перезапишем трудозатраты
		//Кухарь 25.11.19 начало
		если ЗначениеЗаполнено(ДокОснование) тогда
			//Кухарь 25.11.19 конец
			
			если ДокОснование.Метаданные().Имя="РасходнаяНакладная" тогда
				для каждого СтрТЧ из Накладные цикл
					// Шворобей ВЮ 31.07.2025 https://yougile.collant.ru/team/ab6bad3a05c0/#HELP-5975
					Если ЕстьРеквизитДокумента("КоличествоПаллет", СтрТЧ.Накладная.Метаданные()) Тогда
						СтрТЧ.КоличествоПаллет=СтрТЧ.Накладная.КоличествоПаллет;
					КонецЕсли;
					Если ЕстьРеквизитДокумента("КоличествоКоробок", СтрТЧ.Накладная.Метаданные()) Тогда
						СтрТЧ.КоличествоКоробок=СтрТЧ.Накладная.КоличествоКоробок;
					КонецЕсли;
					// Шворобей ВЮ 31.07.2025 https://yougile.collant.ru/team/ab6bad3a05c0/#HELP-5975
				КонецЦикла;
			КонецЕсли;
			
			
			//Кухарь 05.02.19 начало
			//Перезапишем трудозатраты
			если ДокОснование.Метаданные().Имя="РасходнаяНакладная" или ДокОснование.Метаданные().Имя="Перемещение" тогда			
				НужноЗаписывать=ложь;
				если ВидРаботы=Справочники.ВидыВыполняемыхРабот.ДопОбработка и ДокОснование.ТрудозатратыНаДО<>КоличествоЧеловекоЧасов тогда
					ДокОснованиеОбъект=ДокОснование.ПолучитьОбъект();
					ДокОснованиеОбъект.ТрудозатратыНаДО=КоличествоЧеловекоЧасов;
					ДокОснованиеОбъект.ВремяНаДО=ВремРаботы;
					//Кухарь 27.02.19 начало
					//трудозатраты на ДО будут вычисляться в модуле накладной
					//НужноЗаписывать=Истина;
					//Кухарь 27.02.19 начало
				ИначеЕсли ВидРаботы=Справочники.ВидыВыполняемыхРабот.Термоусадка и ДокОснование.ТрудозатратыНаТермоусадку<>КоличествоЧеловекоЧасов тогда
					ДокОснованиеОбъект=ДокОснование.ПолучитьОбъект();
					ДокОснованиеОбъект.ТрудозатратыНаТермоусадку=КоличествоЧеловекоЧасов;
					ДокОснованиеОбъект.ВремяНаТермоусадку=ВремРаботы;
					НужноЗаписывать=Истина;
				ИначеЕсли ВидРаботы=Справочники.ВидыВыполняемыхРабот.НайтиПоКоду("000000004")  и ДокОснование.ТрудозатратыНаПаллетирование<>КоличествоЧеловекоЧасов тогда//Паллетирование
					ДокОснованиеОбъект=ДокОснование.ПолучитьОбъект();
					ДокОснованиеОбъект.ТрудозатратыНаПаллетирование=КоличествоЧеловекоЧасов;
					ДокОснованиеОбъект.ВремяНаПаллетирование=ВремРаботы;	
					НужноЗаписывать=Истина;
				КонецЕсли;
				если НужноЗаписывать = Истина тогда
					ДокОснованиеОбъект.Записать(РежимЗаписиДокумента.Запись);
				КонецЕсли;
			КонецЕсли;
			//Кухарь 05.02.19 конец
			//Кухарь 05.02.19 начало
			//Перезапишем трудозатраты
			//Кухарь 25.11.19 начало
		КонецЕсли;
		//Кухарь 25.11.19 конец
		
	КонецЕсли;
	если СтрокаОшибок<>"" тогда
		#Если клиент тогда
			//Кухарь 06.03.19 начало
			//Блокирует базу
			//Предупреждение(СтрокаОшибок);
			Сообщить(СтрокаОшибок);
			//Кухарь 06.03.19 конец		
		#КонецЕсли
		отказ=Истина;
	КонецЕсли;
	
	// Кельманов А.В. - SNL-189 - 2026.04.24 {
	Если Не Отказ И Не ДополнительныеСвойства.Свойство("Автозаполнение") Тогда
		
		БригадаСформирована = Истина;
		
	КонецЕсли;
	// Кельманов А.В. - SNL-189 - 2026.04.24 }
	
	КоличествоКоробов=Накладные.Итог("КоличествоКоробок");
	КоличествоСтрокДокОснования=Накладные.Итог("КоличествоСтрок");
	КоличествоШтук=Накладные.Итог("КоличествоШтук");
	КоличествоПаллет=Накладные.Итог("КоличествоПаллет");
	
	//Кухарь 13.08.18 начало
	//Термоусадка теперь будет в коллективных работах
	если ВидРаботы=Справочники.ВидыВыполняемыхРабот.Термоусадка и РежимЗаписи<>РежимЗаписиДокумента.ОтменаПроведения тогда
		ТекСотрудник=Справочники.ФизическиеЛица.ПустаяСсылка();
		Для каждого СтрТЧ из Данные цикл
			если СтрТЧ.Сотрудник<>Справочники.ФизическиеЛица.ПустаяСсылка() тогда
				ТекСотрудник=СтрТЧ.Сотрудник;
			КонецЕсли;
		КонецЦикла;		
		Для каждого Накладная из Накладные цикл
			НакладнаяСсылка=Накладная.Накладная;
			ЗаписатьПланНабора(НакладнаяСсылка,ТекСотрудник);
		КонецЦикла;
	КонецЕсли;
	//Кухарь 13.08.18 конец	    
	
КонецПроцедуры            


Процедура ПроверитьЗанятостьСотрудников()
	
	//Феданченков М.С. 02.07.2026 начало
	//Проблема 0000000162
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ
	|   СтатусРаботыСотрудникаСрезПоследних.Сотрудник КАК Сотрудник
	|ИЗ
	|   РегистрСведений.СтатусРаботыСотрудника.СрезПоследних(
	|       ,
	|       ДокументОснования = &ДокументОснования
	|           И ДатаОкончания = &ДатаОкончания) КАК СтатусРаботыСотрудникаСрезПоследних";
	Запрос.УстановитьПараметр("ДокументОснования", Ссылка);
	Запрос.УстановитьПараметр("ДатаОкончания", Дата(1,1,1));
	
	ТаблицаСуществующих = Запрос.Выполнить().Выгрузить();
	
	СуществующиеСотрудники = Новый Соответствие;
	ЕстьСуществующие = ТаблицаСуществующих.Количество() > 0;
	
	Если ЕстьСуществующие Тогда
		Для каждого СтрСущ из ТаблицаСуществующих Цикл
			СуществующиеСотрудники.Вставить(СтрСущ.Сотрудник, Истина);
		КонецЦикла;
	КонецЕсли;
	//Феданченков М.С. 02.07.2026 конец
	
	//https://yougile.collant.ru/team/ab6bad3a05c0/#SNL-105
	
	Если ДатаОкончанияРабот<>Дата(1,1,1) Тогда
		
		Для каждого стрСотр из Данные Цикл  
			//ADRESS.ИзменитьСтатусСотрудника(стрСотр.Сотрудник, Ссылка);
			//Феданченков М.С. 02.07.2026 начало
			//Проблема 0000000162
			Если СуществующиеСотрудники.Получить(стрСотр.Сотрудник) = Неопределено Тогда //
				ADRESS.ИзменитьСтатусСотрудника(стрСотр.Сотрудник, Ссылка);
			КонецЕсли;
			
			ADRESS.ЛокальноСнятьЗанятостьСотрудника(стрСотр.Сотрудник, Ссылка, "Коллективные работы - документ закрыт");
			//Феданченков М.С. 02.07.2026 конец
		КонецЦикла	
		
	Иначе
		
		Для каждого стрСотр из Данные Цикл  
			Если СтрСотр.ОкончаниеВыполнения<>Дата(1,1,1) Тогда
				//Феданченков М.С. 02.07.2026 начало
				//Проблема 0000000162
				Если СуществующиеСотрудники.Получить(стрСотр.Сотрудник) = Неопределено Тогда
					ADRESS.ИзменитьСтатусСотрудника(стрСотр.Сотрудник, Ссылка);
				КонецЕсли;
				//Феданченков М.С. 02.07.2026 конец
				
				ADRESS.ЛокальноСнятьЗанятостьСотрудника(стрСотр.Сотрудник, Ссылка, "Коллективные работы - документ закрыт"); 
			Иначе
				ADRESS.ИзменитьСтатусСотрудника(стрСотр.Сотрудник, Ссылка);
			КонецЕсли;
		КонецЦикла	
		
	КонецЕсли; 
	
	//https://yougile.collant.ru/team/ab6bad3a05c0/#SNL-105
	//Феданченков М.С. 02.07.2026 начало
	//Проблема 0000000162
	Если ЕстьСуществующие Тогда
		ТекущиеСотрудники = Новый Соответствие;
		Для каждого стрСотр из Данные Цикл
			Если ЗначениеЗаполнено(стрСотр.Сотрудник) Тогда
				ТекущиеСотрудники.Вставить(стрСотр.Сотрудник, Истина);
			КонецЕсли;
		КонецЦикла;
		
		Для каждого СтрСущ из ТаблицаСуществующих Цикл
			Если ТекущиеСотрудники.Получить(СтрСущ.Сотрудник) = Неопределено Тогда
				ADRESS.ЛокальноСнятьЗанятостьСотрудника(СтрСущ.Сотрудник, Ссылка, "Изменен состав бригады");
			КонецЕсли;
		КонецЦикла;
	КонецЕсли;
	//Феданченков М.С. 02.07.2026 конец
	
КОнецПроцедуры

Процедура ПриЗаписи(Отказ)
	Если НЕ Отказ Тогда 
		
		//Тимофеев Ю.А. https://yougile.collant.ru/team/ab6bad3a05c0/#SNL-105
		ПроверитьЗанятостьСотрудников();
		//Тимофеев Ю.А. //https://yougile.collant.ru/team/ab6bad3a05c0/#SNL-105     	
		
		Если Состояние = Перечисления.СостоянияНакладной.Отгружена И ПоследняяРабота Тогда
			Для Каждого Стр ИЗ Накладные Цикл
				НакладнаяОбъект = Стр.Накладная.ПолучитьОбъект();
				Если НакладнаяОбъект <> Неопределено Тогда
					ФлагИзменять = Ложь;
					Если ЕстьРеквизитДокумента("СостояниеНакладной", Стр.Накладная.Метаданные()) Тогда
						// Кельманов А.В. - 0000000796 - 2026.06.09 {
						//НакладнаяОбъект.СостояниеНакладной = Перечисления.СостоянияНакладной.ОжиданиеПаллетирования;
						Если ДокОснование.Метаданные().Имя = "ПриходнаяНакладная" Тогда   
							//Феданченков М.С. 02.07.2026 начало
							//Проблема 0000000173
							Если ЕстьРеквизитДокумента("ОбработаноЧЗ", Стр.Накладная.Метаданные()) И Не НакладнаяОбъект.ОбработаноЧЗ Тогда
								НакладнаяОбъект.СостояниеНакладной = Перечисления.СостоянияНакладной.ОжиданиеОбработкиЧЗ;
							Иначе
								НакладнаяОбъект.СостояниеНакладной = Перечисления.СостоянияНакладной.ГотоваКПриемке;
							КонецЕсли;
							//Феданченков М.С. 02.07.2026 конец
						Иначе
							НакладнаяОбъект.СостояниеНакладной = Перечисления.СостоянияНакладной.ОжиданиеПаллетирования;
						КонецЕсли;
						// Кельманов А.В. - 0000000796 - 2026.06.09 }
						ФлагИзменять = Истина;
					КонецЕсли;
					Если ФлагИзменять Тогда
						Попытка
							НакладнаяОбъект.Записать();
						Исключение
						       Сообщить(ОписаниеОшибки());
						КонецПопытки;
					КонецЕсли;
				КонецЕсли;
			КонецЦикла;
		КонецЕсли;
	КонецЕсли;
КонецПроцедуры

#КонецОбласти
// Шворобей ВЮ 22.07.2025 https://yougile.collant.ru/team/ab6bad3a05c0/#HELP-5976
